# 列表是有序的，所以支持一系列 可用于任意序列的运算

'''1.运算'''
list1 = [1, 2, 3, 4]
list2 = [5, 6, 7]

a = list1[2]            # 1.索引，取某个元素
print(a)                # 3

b = list1 + list2       # 2.连接，将序列连接
print(b)                # [1, 2, 3, 4, 5, 6, 7]

c1 = list1 * 2          # 3.重复 重复n次连接
c2 = [list1] * 2
print(c1)               # [1, 2, 3, 4, 1, 2, 3, 4]
print(c2)               # [[1, 2, 3, 4], [1, 2, 3, 4]]

d = 2 in list1          # 4.成员 看序列中是否有某个元素
e = 10 in list1
print(d, e)             # True False

f = len(list1)          # 5.长度 询问序列中的个数
print(f)                # 4

list1[2] = 45
print(c2)               # [[1, 2, 45, 4], [1, 2, 45, 4]]


